# Exploratory Data Analysis Project in MySQL

In [24]:
%sql mysql+pymysql://root:***@localhost:3306/company_ltd

#### 1.) How many staff do we have in the company?

In [49]:
%%sql 
SELECT COUNT(*) total_staff 
FROM stafftable;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
1 rows affected.

[(9,)]

#### 2.) How many staff are younger than 30 years?

In [48]:
%%sql 
SELECT COUNT(age) greater_than_30 
FROM stafftable WHERE age > 30;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
1 rows affected.

[(3,)]

#### 3.) How many staff are between 30 and 25 years?

In [47]:
%%sql 
SELECT COUNT(*) age_25_to_30 
FROM stafftable 
WHERE age BETWEEN 25 AND 30;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
1 rows affected.

[(6,)]

#### 4.) Select all the female staff and sort their age in descending order (from the oldest to the youngest)

In [50]:
%%sql
SELECT *
FROM stafftable
WHERE StaffSex = 'Female'
ORDER BY Age DESC;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
6 rows affected.

[('EMP005', 'Nina', 'Female', 35),
 ('EMP006', 'Collette', 'Female', 33),
 ('EMP004', 'Anita', 'Female', 31),
 ('EMP007', 'Grace', 'Female', 29),
 ('EMP003', 'Cynthia', 'Female', 28),
 ('EMP009', 'Emelda', 'Female', 25)]

#### 5.) What is the Average age of Peter and Nina?

In [51]:
%%sql
SELECT AVG(Age) avg_age
FROM stafftable
WHERE StaffName IN  ('Peter', 'Nina');

 * mysql+pymysql://root:***@localhost:3306/company_ltd
1 rows affected.

[(Decimal('32.5000'),)]

#### 6.) How many customers do we have?

In [54]:
%%sql
SELECT COUNT(*) total_customers
FROM customertable;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
1 rows affected.

[(20,)]

#### 7.) How many customers are from Cameroon?

In [58]:
%%sql
SELECT COUNT(*) total_cust_cmr
FROM customertable
WHERE CustomerCountry = 'Cameroon';

 * mysql+pymysql://root:***@localhost:3306/company_ltd
1 rows affected.

[(4,)]

#### 8.) How many male customers are from Cameroon?

In [60]:
%%sql
SELECT COUNT(*) male_cust_cmr
FROM customertable
WHERE CustomerCountry = 'Cameroon' AND CustomerSex = 'Male';

 * mysql+pymysql://root:***@localhost:3306/company_ltd
1 rows affected.

[(2,)]

#### 9.) What are the First names and Last names of customers who come from Togo and USA?

In [61]:
%%sql
SELECT customerfirstname firstname, customerlastname lastname
FROM customertable
WHERE CustomerCountry IN ('Togo', 'USA');

 * mysql+pymysql://root:***@localhost:3306/company_ltd
7 rows affected.

[('Michael', 'Brown'),
 ('George', 'Niba'),
 ('Tupac', 'Daniel'),
 ('Michelle', 'Okacha'),
 ('Kevin', 'Little'),
 ('Festus', 'Akwa'),
 ('Andrew', 'White')]

#### 10.) Show the first 5 oldest customers

In [62]:
%%sql
SELECT *
FROM customertable
ORDER BY age
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
5 rows affected.

[('CUST015', 'Festus', 'Akwa', 'Male', 'Togo', 22),
 ('CUST009', 'Simon', 'Fonyuy', 'Male', 'Uganda', 25),
 ('CUST006', 'Robert', 'Kelly', 'Male', 'Cameroon', 25),
 ('CUST010', 'Grace', 'Brown', 'Female', 'Japan', 28),
 ('CUST005', 'Nina', 'Okoye', 'Female', 'Japan', 28)]

#### 11.) What is the average age of customers per country?

In [63]:
%%sql
SELECT customercountry country, AVG(age) avg_age_ctry
FROM customertable
GROUP BY CustomerCountry;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
8 rows affected.

[('USA', Decimal('30.0000')),
 ('Togo', Decimal('29.0000')),
 ('Cameroon', Decimal('32.0000')),
 ('Holland', Decimal('30.5000')),
 ('Japan', Decimal('28.0000')),
 ('Uganda', Decimal('25.0000')),
 ('Nigeria', Decimal('36.5000')),
 ('Brazil', Decimal('32.0000'))]

#### 12.) What is the total profit we made?

In [64]:
%%sql
SELECT SUM(profit) total_profit
FROM salestable;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
1 rows affected.

[(Decimal('2760212'),)]

#### 13.) What is the total cost we incurred for these 03 countries "Cameroon","USA","Togo"?

In [66]:
%%sql
SELECT c.customercountry country, SUM(s.cost) total_cost
FROM customertable c
JOIN salestable s
ON c.CustomerCode = s.CustomerCode
WHERE CustomerCountry IN ('Cameroon', 'USA', 'Togo')
GROUP BY CustomerCountry;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
3 rows affected.

[('Cameroon', Decimal('400083')),
 ('USA', Decimal('381555')),
 ('Togo', Decimal('303083'))]

#### 14.) What is the total profit we made per country?

In [67]:
%%sql
SELECT c.customercountry country, SUM(s.profit) total_profit
FROM customertable c
JOIN salestable s
ON c.CustomerCode = s.CustomerCode
GROUP BY CustomerCountry;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
8 rows affected.

[('Holland', Decimal('276619')),
 ('Cameroon', Decimal('570698')),
 ('Nigeria', Decimal('293063')),
 ('Brazil', Decimal('248049')),
 ('USA', Decimal('555298')),
 ('Japan', Decimal('229344')),
 ('Togo', Decimal('431856')),
 ('Uganda', Decimal('155285'))]

#### 15.) What is the average profit we made per country?

In [68]:
%%sql
SELECT c.customercountry country, AVG(s.profit) AVG_profit
FROM customertable c
JOIN salestable s
ON c.CustomerCode = s.CustomerCode
GROUP BY 1;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
8 rows affected.

[('Holland', Decimal('3896.0423')),
 ('Cameroon', Decimal('4105.7410')),
 ('Nigeria', Decimal('3618.0617')),
 ('Brazil', Decimal('3758.3182')),
 ('USA', Decimal('3910.5493')),
 ('Japan', Decimal('3887.1864')),
 ('Togo', Decimal('4074.1132')),
 ('Uganda', Decimal('4436.7143'))]

#### 16.) What is the total revenue per Staff?

In [69]:
%%sql
SELECT st.StaffName, SUM(s.Revenue) total_rev
FROM stafftable st
JOIN salestable s
ON st.MatriculeNo = s.StaffCode
GROUP BY 1;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
9 rows affected.

[('Michael', Decimal('625848')),
 ('Emelda', Decimal('494880')),
 ('Anita', Decimal('436798')),
 ('Nina', Decimal('343442')),
 ('Cynthia', Decimal('709584')),
 ('Grace', Decimal('532347')),
 ('David', Decimal('715194')),
 ('Peter', Decimal('448071')),
 ('Collette', Decimal('378671'))]

#### 17.) Which countries made more than 100 sales transactions? Sort them in decreasing order (from biggest to smallest)

In [70]:
%%sql
SELECT c.customercountry country, SUM(s.unitssold) qty_sold
FROM customertable c
JOIN salestable s
ON c.CustomerCode = s.CustomerCode
GROUP BY country
HAVING qty_sold > 100
ORDER BY qty_sold DESC;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
8 rows affected.

[('USA', Decimal('234574')),
 ('Cameroon', Decimal('229044')),
 ('Togo', Decimal('172682')),
 ('Nigeria', Decimal('123457')),
 ('Holland', Decimal('106943')),
 ('Brazil', Decimal('98764')),
 ('Japan', Decimal('95771')),
 ('Uganda', Decimal('63675'))]

#### 18.) What is the total profit made per country by the following staff "Emelda","Anita","Cynthia"?

In [72]:
%%sql
SELECT c.customercountry country, SUM(Profit) total_profit
FROM customertable c
JOIN salestable s
ON c.CustomerCode = s.CustomerCode
JOIN stafftable st
ON st.matriculeno = s.staffcode
WHERE StaffName IN ('Anita', 'Emelda', 'Cynthia')
GROUP BY 1
ORDER BY 1;

 * mysql+pymysql://root:***@localhost:3306/company_ltd
5 rows affected.

[('Cameroon', Decimal('357761')),
 ('Holland', Decimal('130655')),
 ('Nigeria', Decimal('126543')),
 ('Uganda', Decimal('155285')),
 ('USA', Decimal('200370'))]